In [2]:
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import pandas as pd

In [3]:
data = pd.read_csv("AirQualityUCI.csv")

In [4]:
data.head()

,Date,Time,CO(GT),PT08.S1(CO),NMHC(GT),Wind,PT08.S2(NMHC),Solor.R,PT08.S3(NOx),NO2(GT),PT08.S4(NO2),Ozone,Temp,RH,AH
0,10-03-2004,18:00:00,2.6,1360,150,11.9,1046,166,1056,113,1692,1268,13.6,48.9,0.7578
1,10-03-2004,19:00:00,2.0,1292,112,9.4,955,103,1174,92,1559,972,13.3,47.7,0.7255
2,10-03-2004,20:00:00,2.2,1402,88,9.0,939,131,1140,114,1555,1074,11.9,54.0,0.7502
3,10-03-2004,21:00:00,2.2,1376,80,9.2,948,172,1092,122,1584,1203,11.0,60.0,0.7867
4,10-03-2004,22:00:00,1.6,1272,51,6.5,836,131,1205,116,1490,1110,11.2,59.6,0.7888

In [5]:
data.isnull().sum()

Date             0
Time             0
CO(GT)           0
PT08.S1(CO)      0
NMHC(GT)         0
Wind             0
PT08.S2(NMHC)    0
Solor.R          0
PT08.S3(NOx)     0
NO2(GT)          0
PT08.S4(NO2)     0
Ozone            0
Temp             0
RH               0
AH               0
dtype: int64

In [6]:
data.shape

(9357, 15)

In [7]:
data.columns

Index(['Date', 'Time', 'CO(GT)', 'PT08.S1(CO)', 'NMHC(GT)', 'Wind',
       'PT08.S2(NMHC)', 'Solor.R', 'PT08.S3(NOx)', 'NO2(GT)', 'PT08.S4(NO2)',
       'Ozone', 'Temp', 'RH', 'AH'],
      dtype='object')

In [8]:
data.dropna(axis=0,inplace=True)

In [42]:
data=data.drop(['Solor.R'],axis=1)

In [43]:
data.isnull().sum()

Date             0
Time             0
CO(GT)           0
PT08.S1(CO)      0
NMHC(GT)         0
PT08.S2(NMHC)    0
PT08.S3(NOx)     0
NO2(GT)          0
PT08.S4(NO2)     0
Ozone            0
Temp             0
RH               0
AH               0
dtype: int64

In [44]:
subset1=data[['RH','Temp','Date']]
subset2=data[['Time','CO(GT)','Temp']]

In [45]:
subset1

        RH  Temp        Date
0     48.9  13.6  10-03-2004
1     47.7  13.3  10-03-2004
2     54.0  11.9  10-03-2004
3     60.0  11.0  10-03-2004
4     59.6  11.2  10-03-2004
...    ...   ...         ...
9352  29.3  21.9  04-04-2005
9353  23.7  24.3  04-04-2005
9354  18.3  26.9  04-04-2005
9355  13.5  28.3  04-04-2005
9356  13.1  28.5  04-04-2005

[9357 rows x 3 columns]

In [46]:
subset2

          Time  CO(GT)  Temp
0     18:00:00     2.6  13.6
1     19:00:00     2.0  13.3
2     20:00:00     2.2  11.9
3     21:00:00     2.2  11.0
4     22:00:00     1.6  11.2
...        ...     ...   ...
9352  10:00:00     3.1  21.9
9353  11:00:00     2.4  24.3
9354  12:00:00     2.4  26.9
9355  13:00:00     2.1  28.3
9356  14:00:00     2.2  28.5

[9357 rows x 3 columns]

In [47]:
integrated_data=pd.merge(subset1,subset2,on='Temp')

In [48]:
integrated_data.tail(3)

          RH  Temp        Date      Time  CO(GT)
399548  51.4  -1.9  02-03-2005  08:00:00     2.4
399549  45.9  -0.5  02-03-2005  09:00:00     2.8
399550  59.4   0.5  08-03-2005  04:00:00  -200.0

In [49]:
data_transformed = data['Time'].str.upper()

In [50]:
data_transformed

0       18:00:00
1       19:00:00
2       20:00:00
3       21:00:00
4       22:00:00
          ...
9352    10:00:00
9353    11:00:00
9354    12:00:00
9355    13:00:00
9356    14:00:00
Name: Time, Length: 9357, dtype: object